{
  "metadata": {
    "event_name": "CASE001",
    "event_description": "The Riverside Robbery - Armed bank heist with multiple suspects",
    "model": "detective-ai-v2",
    "story_length": "2850",
    "reveal_length": "420",
    "border_sentence": "Detective Martinez reviewed all the evidence one final time before making the arrest."
  },
  "story": {
    "full_text": "The First National Bank of Riverside was bustling with the usual Friday afternoon crowd when three masked individuals burst through the front doors at 2:47 PM. Security cameras captured the entire incident as it unfolded.\n\nThe leader, approximately 6 feet tall and wearing a distinctive red bandana, immediately approached the main counter while brandishing a chrome-plated revolver. His two accomplices, one shorter and stockier, the other tall and lean, took positions near the entrances to control the crowd.\n\nTeller Maria Gonzalez later testified that the leader spoke with a slight accent, demanding she fill a black duffel bag with bills from her drawer. 'No dye packs, no alarms, or people get hurt,' he said, his voice muffled by the mask.\n\nMeanwhile, bank security guard Tom Wilson, a 15-year veteran, was in the break room when the alarm was triggered. By the time he reached the main floor, the robbers were already collecting cash from multiple teller stations.\n\nCustomer David Chen, who was making a deposit at the time, noticed something peculiar about the getaway car parked outside – a blue sedan with temporary plates and a distinctive scratch along the driver's side door.\n\nThe robbery lasted exactly 4 minutes and 23 seconds. The perpetrators escaped with approximately $47,000 in cash, but they left behind more clues than they realized.\n\nDetective Sarah Martinez was assigned to the case within an hour of the incident. Her investigation began with reviewing the security footage, which clearly showed the robbers' movements and some identifying features despite their masks.\n\nThe forensics team found fingerprints on the counter where the leader had placed his hand for support. Additionally, the shorter accomplice had dropped a cigarette butt near the entrance, which contained DNA evidence.\n\nDetective Martinez reviewed all the evidence one final time before making the arrest. The fingerprints matched convicted felon Marcus Thompson, 34, who had been released from prison just two months prior. The DNA from the cigarette belonged to his known associate, Jimmy Rodriguez. The getaway car was registered to Thompson's girlfriend, Lisa Park, who had reported it stolen three days after the robbery – clearly an attempt to cover their tracks.\n\nWith this evidence, Detective Martinez was able to secure arrest warrants for all three suspects. Thompson was apprehended at his apartment, Rodriguez was found at a local bar, and Park was arrested at her workplace. All three confessed when confronted with the overwhelming forensic evidence.",
    "reveal_segment": "Detective Martinez reviewed all the evidence one final time before making the arrest. The fingerprints matched convicted felon Marcus Thompson, 34, who had been released from prison just two months prior. The DNA from the cigarette belonged to his known associate, Jimmy Rodriguez. The getaway car was registered to Thompson's girlfriend, Lisa Park, who had reported it stolen three days after the robbery – clearly an attempt to cover their tracks.\n\nWith this evidence, Detective Martinez was able to secure arrest warrants for all three suspects. Thompson was apprehended at his apartment, Rodriguez was found at a local bar, and Park was arrested at her workplace. All three confessed when confronted with the overwhelming forensic evidence.",
    "border_sentence": "Detective Martinez reviewed all the evidence one final time before making the arrest."
  },
  "detection": {
    "solution": "<INVESTIGATION_SUMMARY>\nThis case demonstrates classic robbery investigation techniques. The perpetrators made several critical errors that led to their identification and capture.\n</INVESTIGATION_SUMMARY>\n\n<KEY_EVIDENCE>\n1. Security camera footage showing physical characteristics\n2. Fingerprints on bank counter from suspect Marcus Thompson\n3. DNA evidence from cigarette butt left by Jimmy Rodriguez\n4. Getaway vehicle registration linked to Lisa Park\n5. Witness testimony describing distinctive accent and mannerisms\n</KEY_EVIDENCE>\n\n<SUSPECTS_IDENTIFIED>\nMarcus Thompson (Leader) - 6'0\" male, distinctive red bandana, chrome revolver\nJimmy Rodriguez (Accomplice) - Shorter, stockier build, DNA match from cigarette\nLisa Park (Accomplice/Driver) - Provided getaway vehicle, falsely reported it stolen\n</SUSPECTS_IDENTIFIED>\n\n<INVESTIGATIVE_PROCESS>\nDetective Martinez followed standard protocol: \n1. Secured crime scene and reviewed security footage\n2. Collected physical evidence (fingerprints, DNA)\n3. Cross-referenced evidence with criminal databases\n4. Traced vehicle registration\n5. Coordinated arrests based on forensic matches\n</INVESTIGATIVE_PROCESS>\n\n<OUTCOME>\nAll three suspects apprehended within 48 hours. Full confessions obtained. $43,200 of stolen money recovered. Case closed with 100% clearance rate.\n</OUTCOME>"
  },
  "original_metadata": {
    "story_annotations": {
      "Story Title": "The Riverside Bank Robbery",
      "Case Type": "Armed Robbery",
      "Date of First Publication (YYYY-MM-DD)": "2024-01-15",
      "Solvable?": "Yes",
      "Crime Location": "First National Bank of Riverside",
      "Primary Detective": "Detective Sarah Martinez",
      "Number of Suspects": "3",
      "Evidence Types": "Fingerprints, DNA, Video surveillance, Witness testimony",
      "Case Status": "Closed - All suspects apprehended"
    },
    "author_metadata": {
      "Given Name(s)": "True Detective",
      "Surname(s)": "Cases",
      "Department": "Riverside Police Department"
    },
    "plot_summary": "Three masked robbers hit the First National Bank during a busy Friday afternoon, stealing $47,000. Despite their planning, they left behind fingerprints, DNA evidence, and were captured on security cameras. Detective Martinez used forensic evidence to identify and arrest all three suspects within 48 hours.",
    "case_metadata": {
      "jurisdiction": "Riverside County",
      "investigating_officer": "Detective Sarah Martinez",
      "case_number": "RIV-2024-0115-001",
      "crime_classification": "211 PC - Armed Robbery",
      "arrest_date": "2024-01-17",
      "charges_filed": ["Armed Robbery", "Conspiracy", "False Police Report"]
    }
  }
} 